In [72]:
import pandas as pd

from sqlalchemy import create_engine

# Replace the following with your database connection details

username = 'root'  # Your MySQL username

password = '1234'  # Your MySQL password

host = 'localhost'  # Your MySQL host, e.g., 'localhost' or an IP address

database = 'harini17'  # Your MySQL database name

# Create a connection string using SQLAlchemy

connection_string = f'mysql+mysqlconnector://{username}:{password}@{host}/{database}'

# Create an engine

engine = create_engine(connection_string)

# Read data from MySQL into a pandas DataFrame

df_sql = pd.read_sql('SELECT * FROM Employee', engine)

# Display the DataFrame

print(df_sql)

   EmployeeID     Name Department  Designation   Salary
0         101    Alice         HR      Manager  75000.0
1         102      Bob         IT    Developer  85000.0
2         103  Charlie    Finance      Analyst  70000.0
3         104    David         IT    Team Lead  90000.0
4         105     Emma  Marketing  Coordinator  65000.0

In [73]:
import pandas as pd

from sqlalchemy import create_engine

# Replace the following with your database connection details

username = 'root'  # Your MySQL username

password = '1234'  # Your MySQL password

host = 'localhost'  # Your MySQL host, e.g., 'localhost' or an IP address

database = 'harini17'  # Your MySQL database name

# Create a connection string using SQLAlchemy

connection_string = f'mysql+mysqlconnector://{username}:{password}@{host}/{database}'

# Create an engine

engine = create_engine(connection_string)

# Read data from MySQL into a pandas DataFrame

df1 = pd.read_sql('SELECT * FROM Employee', engine)
df2 = pd.read_csv('employee_details.csv')

merged_df=pd.merge(df1,df2,on='EmployeeID',how='outer')
merged_df

,EmployeeID,Name,Department_x,Designation,Salary,Department_y,HireDate
0,101,Alice,HR,Manager,75000.0,HR,2018-01-15
1,102,Bob,IT,Developer,85000.0,IT,2019-06-23
2,103,Charlie,Finance,Analyst,70000.0,Finance,2020-11-05
3,104,David,IT,Team Lead,90000.0,IT,2017-03-17
4,105,Emma,Marketing,Coordinator,65000.0,Marketing,2021-08-09

In [75]:
print(merged_df['EmployeeID'].dtype)

int64

In [76]:
print(df1['Name'].dtype)

object

In [77]:
print(df1['EmployeeID'].dtype)

int64

In [82]:
print(f"Memory Usage:{df1.memory_usage(deep=True)}")

Memory Usage:Index          132
EmployeeID      40
Name           269
Department     267
Designation    288
Salary          40
dtype: int64

In [88]:
import numpy as np
df1['EmployeeID'] = df1['EmployeeID'].astype(np.int16)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   5 non-null      int16
 1   Name         5 non-null      object
 2   Department   5 non-null      object
 3   Designation  5 non-null      object
 4   Salary       5 non-null      float64
dtypes: float64(1), int16(1), object(3)
memory usage: 302.0+ bytes

In [98]:
import numpy as np
df1['EmployeeID'] = df1['EmployeeID'].astype(np.int16)
df1['Salary'] = df1['Salary'].astype(np.float32) 
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   5 non-null      int16
 1   Name         5 non-null      object
 2   Department   5 non-null      object
 3   Designation  5 non-null      object
 4   Salary       5 non-null      float32
dtypes: float32(1), int16(1), object(3)
memory usage: 282.0+ bytes